{
  "classData": {
    "nightAgent": {
      "name": "NIGHT Agent",
      "description": "NIGHT Agents are special agents of the highest order, members of a paramilitary force that is called upon to enforce peace among aurics and humans - sometimes using extreme measures. As a NIGHT Agent, you're skilled in espionage and magical combat, and will have to decide between the paths of shadowmancy and photomancy for your archetype.",
      "image": "NightAgent.png",
      "stats": {
        "abilities": {
          "strength": 4,
          "agility": 2,
          "will": 2,
          "personality": 0
        },
        "initiative": 4,
        "ac": 18,
        "hp": 26,
        "ceridium": 6,
        "meleeAttack": 6,
        "meleeDamage": "1d12+4",
        "rangedAttack": 4,
        "rangedDamage": "1d6+2",
        "spellAttack": 4,
        "spellDC": 12,
        "skills": {
          "athletics": 6,
          "awareness": 2,
          "discernment": 0,
          "drama": 0,
          "grappling": 6,
          "hacking": 2,
          "healing": 2,
          "knowledge": 2,
          "mancy": 4,
          "nature": 0,
          "negotiation": 0,
          "stealth": 4,
          "thievery": 2,
          "tumbling": 4,
          "vehicles": 2
        }
      },
      "archetypes": {
        "nightpath": {
          "name": "Nightpath",
          "description": "Master of shadow.",
          "spells": {
            "cloakOfShadows": {
              "name": "Cloak of Shadows",
              "action": "Move action",
              "range": "Self",
              "duration": "1 encounter",
              "ceridium": "2",
              "description": "Cloak yourself in shadows, adding +5 to all Stealth skill checks. Hostile creatures within 10 feet of you incur disadvantage on all attack rolls"
            },
            "doubleTrouble": {
              "name": "Double Trouble",
              "action": "Move action",
              "range": "Self",
              "duration": "1 encounter",
              "ceridium": "2",
              "description": "Create a carbon copy of yourself that has 10 HP and appears adjacent to you. When an attack hits you, the attacker must succeed at a DC 15 Awareness skill check; otherwise, the attack hits your doppelganger instead."
            },
            "oneWithShadows": {
              "name": "One with Shadows",
              "action": "Move action",
              "range": "Self",
              "duration": "1 round, until the beginning of your next turn",
              "ceridium": "1",
              "description": "You become the darkness and take a nonmaterial form. While in this form you cannot make attacks, but are immune to damage and can pass through cracks big enough for your two-dimensional form. If you reform in a space too narrow for your body, you reappear instead in the nearest unoccupied space, taking 1d6 damage per 5 feet traveled."
            },
            "shadowBolt": {
              "name": "Shadow Bolt",
              "action": "Combat action",
              "range": "120 feet",
              "duration": "N/A",
              "ceridium": "2",
              "description": "Fire a shadow arrow at one creature within 120 feet, making a spell attack. If it hits, it deals 2d6 damage, and you can teleport to an unoccupied space that you can see within 5 feet of the target."
            },
            "shadowSiphon": {
              "name": "Shadow Siphon",
              "action": "Move action",
              "range": "Melee attack",
              "duration": "1 encounter",
              "ceridium": "2",
              "description": "You empower your nightblade with insatiable darkness. You deal 1d6 extra damage with your melee attack. You regain an amount of hit points equal to the extra damage you do."
            }
          }
        },
        "daypath": {
          "name": "Daypath",
          "description": "Master of light.",
          "spells": {
            "auraOfLight": {
              "name": "Aura of Light",
              "action": "Move action",
              "range": "Self",
              "duration": "1 round, until the end of your next turn",
              "ceridium": "1",
              "description": "You surround yourself with bolstering light. Ranged and spell attacks against you and friendly creatures within 10 feet of you have disadvantage. If they hit, they deal half damage."
            },
            "brightBeing": {
              "name": "Bright Being",
              "action": "Move action",
              "range": "Self or Touch",
              "duration": "1 encounter",
              "ceridium": "3",
              "description": "You radiate blinding and cleansing light. While the spell is active, you cannot be targeted by ranged attacks or spells, regain 1d6 hit points at the beginning of your turn, and can take a combat action to end one spell on yourself or on one willing creature that you touch."
            },
            "haloOfPower": {
              "name": "Halo of Power",
              "action": "Move action",
              "range": "Self",
              "duration": "1 encounter",
              "ceridium": "2",
              "description": "You radiate a blazing aura that lashes out with loops of ionized ceridium. At the beginning of your turn, you deal 1d6 damage to all hostile creatures within 10 feet of you."
            },
            "healingTouch": {
              "name": "Healing Touch",
              "action": "Combat action",
              "range": "Self or Touch",
              "duration": "N/A",
              "ceridium": "1",
              "description": "Channel restorative energy through your hands, healing yourself or one ally for 3d6 hit points."
            },
            "prismaticArrow": {
              "name": "Prismatic Arrow",
              "action": "Combat action",
              "range": "60 feet",
              "duration": "N/A",
              "ceridium": "1",
              "description": "Cast a bolt of shimmering brilliance at one target, making a spell attack. If it hits, deal 2d8 damage, and the target incurs disadvantage on all of its rolls until the end of your next turn."
            }
          }
        }
      },
      "feats": {
        "intoTheFray": {
          "name": "Into the Fray",
          "requirement": "None",
          "description": "When you take two move actions during your turn, you can attempt a melee attack if you end your second move action within 5 feet of a creature."
        },
        "nightTraining": {
          "name": "NIGHT Training",
          "requirement": "None",
          "description": "Your deeds and training in the NIGHT organization have gained you a certain political cachet and allow you to pick up cues that most would miss. You have advantage on Awareness checks to spot a hidden creature, and on Discernment checks to determine whether a creature is lying. Additionally, you can use your political sway to gain advantage on all Negotiation checks when you're dealing with law enforcement."
        },
        "preemptiveStrike": {
          "name": "Preemptive Strike",
          "requirement": "None",
          "description": "Once per round, if a creature attempts to make an attack against you, you can immediately retaliate with a melee attack if you are within 5 feet of it. Your attack is made before the creature's attack."
        },
        "stunningDefense": {
          "name": "Stunning Defense",
          "requirement": "None",
          "description": "Once per round, when a creature hits you with a melee or ranged attack, you can halve the attack's damage against you."
        },
        "swordMastery": {
          "name": "Sword Mastery",
          "requirement": "None",
          "description": "Your skill with the nightblade has become such that it defies logic and reason. When attempting a melee attack with your nightblade, you ignore any damage reduction or immunity held by your target."
        }
      }
    },
    "revolutionary": {
      "name": "Revolutionary",
      "description": "Revolutionaries are often allied to Aurichome, sacrificing the comforts of the status quo for the promise of equality for all underraces. As a Revolutionary, you're trained in all manner of ranged combat, and are unparalleled in your understanding of modern vehicles.",
      "image": "Revolutionary.png",
      "stats": {
        "abilities": {
          "strength": 2,
          "agility": 4,
          "will": 0,
          "personality": 2
        },
        "initiative": 2,
        "ac": 16,
        "hp": 30,
        "ceridium": 2,
        "meleeAttack": 4,
        "meleeDamage": "1d4+2",
        "rangedAttack": 6,
        "rangedDamage": "1d8+4",
        "spellAttack": 2,
        "spellDC": 10,
        "skills": {
          "athletics": 4,
          "awareness": 0,
          "discernment": 2,
          "drama": 2,
          "grappling": 2,
          "hacking": 0,
          "healing": 2,
          "knowledge": 0,
          "mancy": 0,
          "nature": 2,
          "negotiation": 4,
          "stealth": 4,
          "thievery": 4,
          "tumbling": 6,
          "vehicles": 6
        }
      },
      "archetypes": {
        "gunslinger": {
          "name": "Gunslinger",
          "description": "Master of dual pistols.",
          "talents": {
            "doubleShot": {
              "name": "Double Shot",
              "requirement": "None",
              "description": "Once per round, roll a 1d6. If the result is a 5 or higher, you can make an additional ranged attack this turn."
            },
            "highNoon": {
              "name": "High Noon",
              "requirement": "None",
              "description": "Once per round, if one of your ranged attacks hits a target, and there is another target adjacent to the first one that you can see, you can make a separate ranged attack against the second target."
            },
            "privateEscort": {
              "name": "Private Escort",
              "requirement": "None",
              "description": "You gain a +5 bonus on Vehicles skill checks when traveling with at least one more passenger. Additionally, once per round, if you or one of your passengers is hit by a ranged attack, you can make a Vehicles check (DC 10 or at the GM's discretion). If you succeed, halve the attack's damage."
            },
            "quickDraw": {
              "name": "Quick Draw",
              "requirement": "None",
              "description": "Your ranged attacks have advantage against targets against which you have a higher Initiative."
            },
            "runAndGun": {
              "name": "Run and Gun",
              "requirement": "None",
              "description": "There's always room for acrobatics, especially during a firefight. Once per round, you can attempt a Tumbling check (DC 10 or at the GM's discretion) to combine a move action with a ranged attack. On a success, you can take an extra move action after your ranged attack. On a failure, you spend your move action as you normally would."
            }
          }
        },
        "sharpshooter": {
          "name": "Sharpshooter",
          "description": "Master of sniping.",
          "talents": {
            "fireAtWill": {
              "name": "Fire at Will",
              "requirement": "None",
              "description": "You lay down suppressive fire, forcing your target to stay put - or else. Once per round, when you hit a target with a ranged attack, you gain advantage on ranged attack rolls against that target until the end of your next turn. If the target attempts to take a move action on its turn, you can immediately make a ranged attack against it, with advantage, as well."
            },
            "shootToKill": {
              "name": "Shoot to Kill",
              "requirement": "Snipe",
              "description": "Spend a move action, aiming at a target. Until the beginning of your next turn, add +4 to your ranged attack roll and damage against that target and extend your critical range against that target to 17-20. This talent replaces Snipe."
            },
            "snipe": {
              "name": "Snipe",
              "requirement": "None",
              "description": "Spend a move action, aiming at a target. Until the beginning of your next turn, add +2 to your ranged attack roll and damage against that target and extend your critical range against that target to 19-20."
            },
            "sprayAndPray": {
              "name": "Spray and Pray",
              "requirement": "None",
              "description": "Sometimes a hammer will do when a screwdriver won't. Roll 1d4 and subtract the result from your attack roll, adding it to your damage roll."
            },
            "tacticalSupport": {
              "name": "Tactical Support",
              "requirement": "None",
              "description": "You gain advantage on Initiative. Whenever you roll Initiative, you can pick one of the rolls for yourself, and an ally that can hear you can replace their Initiative roll with the other."
            }
          }
        }
      },
      "feats": {
        "fullMatrices": {
          "name": "Full Matrices",
          "requirement": "None",
          "description": "Your honed reflexes and uncanny sense of danger have saved you more than once. Once per round, when an attack hits you, make a Tumbling check, with a DC equal to the attack roll of your target. If you succeed, you take half damage, rather than full damage, from the attack."
        },
        "knowledgeIsPower": {
          "name": "Knowledge is Power",
          "requirement": "None",
          "description": "You've had to study all manner of opponents to ensure your survival. Once per round, you can make a Negotiation check against a target's AC. If you succeed, you have advantage on attack rolls against that target until the beginning of your next turn."
        },
        "revolutionaryConnections": {
          "name": "Revolutionary Connections",
          "requirement": "None",
          "description": "Your networking has made the most impossible of connections probable. Double your skill bonus for all Negotiation checks with factions for which you have at least Neutral standing."
        },
        "secondChance": {
          "name": "Second Chance",
          "requirement": "None",
          "description": "Once per mission, if the damage from a creature's attack will reduce your hit points to 0 or below, reduce your hit points to 1 instead."
        },
        "thousandYardStare": {
          "name": "Thousand Yard Stare",
          "requirement": "None",
          "description": "If you have advantage on a ranged attack, you can forgo the advantage to double your damage for that attack."
        }
      }
    },
    "technomancer": {
      "name": "Technomancer",
      "description": "Technomancers are gifted to the extreme in hacking, robotics, and manipulating any type of machinery. As a Technomancer, your training allows you to get closer to the metal with feats and spells than any other class.",
      "image": "Technomancer.png",
      "stats": {
        "abilities": {
          "strength": 0,
          "agility": 2,
          "will": 4,
          "personality": 2
        },
        "initiative": 2,
        "ac": 16,
        "hp": 24,
        "ceridium": 10,
        "meleeAttack": 2,
        "meleeDamage": "1d4",
        "rangedAttack": 4,
        "rangedDamage": "1d6+2",
        "spellAttack": 6,
        "spellDC": 14,
        "skills": {
          "athletics": 0,
          "awareness": 4,
          "discernment": 4,
          "drama": 2,
          "grappling": 0,
          "hacking": 6,
          "healing": 4,
          "knowledge": 6,
          "mancy": 6,
          "nature": 2,
          "negotiation": 2,
          "stealth": 2,
          "thievery": 2,
          "tumbling": 2,
          "vehicles": 4
        }
      },
      "archetypes": {
        "combatEngineer": {
          "name": "Combat Engineer",
          "description": "Master of combat engineering.",
          "spells": {
            "fireDrill": {
              "name": "Fire Drill",
              "action": "Combat action",
              "range": "N/A",
              "duration": "N/A",
              "ceridium": "1",
              "description": "Make a ranged attack with your Devious Prototype and add your Mancy skill bonus to the roll. If it hits, double the normal damage of your Devious Prototype for the attack."
            },
            "hackAndSlash": {
              "name": "Hack and Slash",
              "action": "Move action",
              "range": "N/A",
              "duration": "1 encounter",
              "ceridium": "2",
              "description": "Once per round, when an attack hits you, you can respond by attempting a ranged attack with your Devious Prototype."
            },
            "overload": {
              "name": "Overload",
              "action": "Combat action",
              "range": "30 feet",
              "duration": "1 round, until the end of your next turn",
              "ceridium": "2",
              "description": "You send a jolt of energy at a target, attempting to fry their weapon. Choose a manufactured ranged weapon, such as a firearm or a drone's integrated gun, that you can see within range. Make a spell attack against the target. If it hits, the target's ranged weapon cannot be used to attack for the duration of the spell, and the target takes 2d6 damage."
            },
            "systemFailure": {
              "name": "System Failure",
              "action": "Combat action",
              "range": "30 feet",
              "duration": "1 round, until the end of your next turn",
              "ceridium": "1",
              "description": "You hack the systems of a machine or an artificial creature, shutting it down temporarily. Make a Hacking check, contested by the target's own Hacking check. If you succeed, the target is unable to take actions, and all attacks made against it have advantage."
            },
            "whiteHat": {
              "name": "White Hat",
              "action": "Move action",
              "range": "Self",
              "duration": "1 encounter",
              "ceridium": "1",
              "description": "Your technomancy skills allow you to augment your networking for a brief period of time. Add +5 to your Hacking skill. Additionally, you can hack a device or artificial creature in half the time usually required."
            }
          }
        },
        "netSpecialist": {
          "name": "Net Specialist",
          "description": "Master of the network.",
          "spells": {
            "blackHat": {
              "name": "Black Hat",
              "action": "Move action",
              "range": "Self",
              "duration": "1 encounter",
              "ceridium": "2",
              "description": "Your technomancy skills are superior to all others, allowing you to augment your networking for a brief period of time. Add +10 to your Hacking skill. Additionally, you can hack a device or artificial creature in half the time usually required."
            },
            "helloWorld": {
              "name": "Hello World",
              "action": "Combat action",
              "range": "30 feet",
              "duration": "1 round, until the beginning of your next turn",
              "ceridium": "1",
              "description": "You quickly write an override program and give it a nudge with the tiniest bit of power. Choose one artificial creature within range and make a Hacking check, contested by the target's Hacking check. If you succeed, you take control of the target for the spell's duration. The target takes only the actions you choose, and doesn't do anything that you don't allow it to do"
            },
            "needARide": {
              "name": "Need a Ride",
              "action": "Move action",
              "range": "N/A",
              "duration": "N/A",
              "ceridium": "1",
              "description": "If you are in a urban area, you can automatically call a standard net-enabled vehicle, such as an antigravity car or patrol boat, to your location, regardless of its locking mechanisms and current occupancy. If you are in a rural area, there is a 33 percent chance that the spell functions. The vehicle travels to you at its base speed, taking the most logical, efficient route while still abiding by local transportation laws."
            },
            "optimizeVariables": {
              "name": "Optimize Variables",
              "action": "Move action",
              "range": "Self or Touch",
              "duration": "1 encounter",
              "ceridium": "3",
              "description": "You optimize the gear of an ally. The ceridium cost of their spells and cybernetics is reduced by 1, to a minimum of 0, for the duration of the spell."
            },
            "trackWithoutTrace": {
              "name": "Track without Trace",
              "action": "Move action",
              "range": "Self",
              "duration": "N/A",
              "ceridium": "1",
              "description": "Your comfort with finding information on the network - with a little help from your technomancy skill - is such that only the most gifted can elude you. If a person, creature, or object is in an urban area and not purposely isolated from the network, you can attempt to determine their current location. Make a Hacking check with advantage, contested by the target's own Hacking check. If your Hacking check succeeds, you discern the target's current exact location. If it fails by 5 or more, the target detects your attempt."
            }
          }
        }
      },
      "feats": {
        "deviousPrototype01": {
          "name": "Devious Prototype 0.1",
          "requirement": "None",
          "description": "You begin building the framework for a companion weapon, taking the form of a mobile turret, drone, or similar device. At the start of each mission, you can decide how you've modified your prototype by choosing between Assault, Defender, Explorer or Medical (consult the 'Devious Prototype' section on Page 36). The Devious Prototype can move and attack independently of its master, and can take basic actions on your behalf, such as delivering spells with the touch requirement. It has its own turn and actions, playing before or after you in the Initiative order. It can also transmit your voice and relay live and archived video footage to you. Unless indicated otherwise in its statblock, the Devious Prototype has an AC of 10, 10 hit points, and its own ability bonuses. Unless empowered by other spells, it can make a ranged attack once per round as a combat action. Its speed is indicated in its statblock, based on the type of prototype you choose."
        },
        "deviousPrototype02": {
          "name": "Devious Prototype 0.2",
          "requirement": "Devious Prototype 0.1",
          "description": "Work on your Devious Prototype has continued, increasing its AC to 12, hit points to 12, and it can attack twice when it takes a combat action."
        },
        "deviousPrototype03": {
          "name": "Devious Prototype 0.3",
          "requirement": "Devious Prototype 0.2",
          "description": "Your Devious Prototype is not yet market-ready but is quickly increasing in effectiveness. It now has an AC of 14, 14 hit points, and can attack twice when it takes a combat action. Additionally, its damage increases by an additional 1d4 for each attack."
        },
        "juryRigging": {
          "name": "Jury-Rigging",
          "requirement": "Devious Prototype 0.1",
          "description": "You are an expert at repurposing spare parts to repair your Devious Prototype. At the end of an encounter, if one or more artificial creatures were destroyed, excluding your Devious Prototype, you can use the remains to repair your Devious Prototype. It regains 1d4 + 4 hit points. Additionally, you gain advantage on all Hacking and Vehicles checks when attempting to repair a broken device."
        },
        "pinballWizard": {
          "name": "Pinball Wizard",
          "requirement": "None",
          "description": "Your constant tinkering with spells allows you to broaden their effectiveness once in a while. Once per round, you can add one target within range to any single-target Technomancy spell you cast, doubling the ceridium cost for that spell."
        }
      }
    },
    "terramancer": {
      "name": "Terramancer",
      "description": "Terramancers have dedicated their lives towards communing with nature, drawing their inspiration from the flora and fauna around them. As a Terramancer, your proficiency with healing magic is unmatched, as is your ability to throw projectiles with deadly effect.",
      "image": "Terramancer.png",
      "stats": {
        "abilities": {
          "strength": 0,
          "agility": 2,
          "will": 2,
          "personality": 4
        },
        "initiative": 2,
        "ac": 16,
        "hp": 24,
        "ceridium": 10,
        "meleeAttack": 2,
        "meleeDamage": "1d4",
        "rangedAttack": 4,
        "rangedDamage": "1d6+2",
        "spellAttack": 6,
        "spellDC": 14,
        "skills": {
          "athletics": 0,
          "awareness": 2,
          "discernment": 4,
          "drama": 4,
          "grappling": 0,
          "hacking": 2,
          "healing": 4,
          "knowledge": 4,
          "mancy": 4,
          "nature": 6,
          "negotiation": 6,
          "stealth": 2,
          "thievery": 2,
          "tumbling": 2,
          "vehicles": 2
        }
      },
      "archetypes": {
        "arcanePitcher": {
          "name": "Arcane Pitcher",
          "description": "Master of magic.",
          "spells": {
            "fourSeamFastball": {
              "name": "4-Seam Fastball",
              "action": "Combat action",
              "range": "Ceridium orb's range (standard: 30 feet)",
              "duration": "N/A",
              "ceridium": "2",
              "description": "Make a spell attack against a target, using your ceridium orb as a magic-empowered projectile. If it hits, you can make it ricochet to another target which must be within the ceridium orb's range of the previous target. The orb can hit as many as two other targets, including the original target, and you must make a separate spell attack for each target. Each time the orb hits a target it deals 2d6 extra damage, up to a cumulative 4d6. If you miss an attack, the spell ends."
            },
            "seventhInningStretch": {
              "name": "7th Inning Stretch",
              "action": "Combat action",
              "range": "Self",
              "duration": "N/A",
              "ceridium": "2",
              "description": "You're able to find respite in the midst of the storm. Heal a total of 3d6 hit points between yourself and any organic creature within 5 feet of you."
            },
            "knuckleball": {
              "name": "Knuckleball",
              "action": "Combat action",
              "range": "Ceridium orb's range (standard: 30 feet)",
              "duration": "N/A",
              "ceridium": "1",
              "description": "Make a spell attack against a target, using your ceridium orb as a magic-empowered projectile. If it hits, you deal an extra 2d6 damage. If the target is a creature, it must succeed on a Strength check against your spell DC or it can't take actions until the end of its next turn."
            },
            "reliefPitcher": {
              "name": "Relief Pitcher",
              "action": "Move action",
              "range": "Self",
              "duration": "1 encounter",
              "ceridium": "2",
              "description": "When you make an attack with your ceridium orb or a grenade, its range is doubled, and you can decide to make a spell attack instead of a ranged attack. Your ceridium orb deals an extra +4 damage when it hits."
            },
            "slider": {
              "name": "Slider",
              "action": "Combat action",
              "range": "Ceridium orb's range (standard: 30 feet)",
              "duration": "N/A",
              "ceridium": "2",
              "description": "You create energy-based simulacra of your ceridium orb that continue to duplicate as they pass through cover and enemies. Your next ceridium orb attack automatically hits every creature in a line equal to your weapon's range and deals an extra 2d6 damage."
            }
          }
        },
        "naturesHarbinger": {
          "name": "Nature's Harbinger",
          "description": "Master of nature.",
          "spells": {
            "awakenTheBeast": {
              "name": "Awaken the Beast",
              "action": "Move action",
              "range": "Self or 30 feet",
              "duration": "1 round, until the end of your next turn",
              "ceridium": "1",
              "description": "You awaken the inner beast of a creature. Choose an organic creature within range. The creature can take an extra combat action on its turn."
            },
            "healPlease": {
              "name": "Heal, Please",
              "action": "Combat action",
              "range": "Self or 60 feet",
              "duration": "N/A",
              "ceridium": "1",
              "description": "You draw upon the forces of nature to bring healing energy to those around you. One organic creature within range that you can see regains 4d8 hit points."
            },
            "naturesWrath": {
              "name": "Nature's Wrath",
              "action": "Move action",
              "range": "Self or 30 feet",
              "duration": "1 encounter",
              "ceridium": "2",
              "description": "The natural world knows its allies and protects its own. Once per round, when an attack hits you or an ally within range that you can see, spectral beasts manifest to retaliate, inflicting 2d8 damage to the attacker. The beasts take forms of your choosing."
            },
            "summonBeast": {
              "name": "Summon Beast",
              "action": "Combat action",
              "range": "30 feet",
              "duration": "1 encounter",
              "ceridium": "1",
              "description": "You roar into the ether and an animal companion responds to your call. Choose an animal from the following list to be summoned in a free 5-foot space within the spell's range: bear, bobcat, crocodile, eagle, fox, python, stag, wolf (consult the 'Animal Companions' section on Page 34). Until the end of the spell, you gain a bonus based on the 'Nature's Chosen' feature of your animal companion. You establish a telepathic link with your animal companion. Through it, the animal can understand your telepathic messages to it, and it can telepathically communicate simple emotions and concepts back to you. You cannot have more than one animal companion at any time. If your animal companion is reduced to 0 hit points or the spell ends, it disappears back into the ether."
            },
            "telluricConduit": {
              "name": "Telluric Conduit",
              "action": "Combat action",
              "range": "10-foot circle",
              "duration": "N/A",
              "ceridium": "2",
              "description": "You channel the telluric powers coursing through the earth. You and all friendly organic creatures within 10 feet of you regain 2d6 + 4 hit points."
            }
          }
        }
      },
      "feats": {
        "arcaneWard": {
          "name": "Arcane Ward",
          "requirement": "None",
          "description": "Your understanding of magic allows you to better defend yourself against it. You gain advantage on checks made against spells and other magical effects."
        },
        "holisticHealer": {
          "name": "Holistic Healer",
          "requirement": "None",
          "description": "Your intuitive understanding of all life grants you advantage on Healing checks, and you can add your Nature skill bonus to your Healing checks in addition to any other bonuses. Whenever you use a spell to restore hit points to a creature, the creature regains an additional 1d6 hit points."
        },
        "reflectiveWard": {
          "name": "Reflective Ward",
          "requirement": "Arcane Ward",
          "description": "Once per round, when you are hit by a spell or ranged attack, you can make a Mancy check, with a DC equal to the result of the attack roll. If your check is successful, the attack is reflected back at the attacker as though it originated from you, turning the attacker into the target. The spell or ranged attack retains its initial attack roll."
        },
        "strengthOfTheEarth": {
          "name": "Strength of the Earth",
          "requirement": "None",
          "description": "You've entrenched yourself into the natural world, occasionally being able to draw magic from the earth itself. When you cast a spell, roll a d6. On a 5 or higher, you regain the ceridium cost of the spell."
        },
        "teamSpirit": {
          "name": "Team Spirit",
          "requirement": "None",
          "description": "You know from experience that while one wolf is scary, an entire wolf pack is terrifying. Once per round, when an ally within your range hits a target that you can see, you can make a ranged attack against the same target."
        }
      }
    },
    "vanguard": {
      "name": "Vanguard",
      "description": "Vanguards thrive in the shadows, specializing in the arts of stealth and subterfuge. As a Vanguard, your skills in remaining unseen and getting the drop on your opponents are unparalleled.",
      "image": "Vanguard.png",
      "stats": {
        "abilities": {
          "strength": 0,
          "agility": 4,
          "will": 2,
          "personality": 2
        },
        "initiative": 4,
        "ac": 18,
        "hp": 24,
        "ceridium": 2,
        "meleeAttack": 6,
        "meleeDamage": "2d6+4",
        "rangedAttack": 2,
        "rangedDamage": "1d4",
        "spellAttack": 4,
        "spellDC": 12,
        "skills": {
          "athletics": 0,
          "awareness": 2,
          "discernment": 2,
          "drama": 4,
          "grappling": 0,
          "hacking": 4,
          "healing": 2,
          "knowledge": 2,
          "mancy": 2,
          "nature": 2,
          "negotiation": 2,
          "stealth": 6,
          "thievery": 6,
          "tumbling": 6,
          "vehicles": 4
        }
      },
      "archetypes": {
        "assassin": {
          "name": "Assassin",
          "description": "Master of assassins.",
          "talents": {
            "assassinsQuarry": {
              "name": "Assassin's Quarry",
              "requirement": "None",
              "description": "You've trained yourself to block out all distractions as you close in on your prey. Once per encounter, choose one creature that you can see within 60 feet of you. The first time each turn that you hit that target with a melee attack, it takes an extra 1d6 damage from the attack. If you reduce your quarry to 0 hit points, you can immediately take an extra move and combat action, even if you've already taken a move and combat action this turn."
            },
            "bloodInTheWater": {
              "name": "Blood in the Water",
              "requirement": "Compromising Strike",
              "description": "You're able to sense weakness and exploit it to your advantage. If you hit with a melee attack against a creature that has fewer than its maximum hit points, add your Compromising Strike damage."
            },
            "faceInTheCrowd": {
              "name": "Face in the Crowd",
              "requirement": "N/A",
              "description": "You've learned that the best way to remain unseen is by blending in. You gain a +6 bonus on all Drama checks when attempting to appear inconspicuous, impersonate someone, or utilize a disguise."
            },
            "killOrBeKilled": {
              "name": "Kill or Be Killed",
              "requirement": "None",
              "description": "You leave nothing to chance. If you're able to observe a creature for 1 round before engaging in combat, your first melee attack against that creature automatically hits for critical damage."
            },
            "stareDown": {
              "name": "Stare Down",
              "requirement": "Compromising Strike",
              "description": "If you reduce a creature to 0 hit points with a Compromising Strike, all hostile organic creatures that can see you must make a Will check with a DC equal to your attack roll. Each creature that fails the check cannot come closer to you or target you with a spell or ranged attack until the beginning of your next turn."
            }
          }
        },
        "shadowstalker": {
          "name": "Shadowstalker",
          "description": "Master of shadows.",
          "talents": {
            "highwayRobbery": {
              "name": "Highway Robbery",
              "requirement": "None",
              "description": "Once per round, when you hit with a melee attack, you can make a Stealth check, contested against the target's Awareness check. If you succeed, you have advantage on attack rolls against that target until the end of your next turn."
            },
            "hitAndRun": {
              "name": "Hit and Run",
              "requirement": "None",
              "description": "Once per round, when you reduce a creature to 0 hit points, you can take an extra move action. If you finish this move action within 5 feet of a hostile creature, you can make a melee attack."
            },
            "sandInTheEyes": {
              "name": "Sand in the Eyes",
              "requirement": "None",
              "description": "If you have advantage on a melee attack, you can forgo the advantage and make a regular attack roll to attempt to stun an organic creature. If you hit, you deal damage as you normally would, and the target must succeed on a Will check with a DC equal to your attack roll. On a failure, the target cannot take combat actions until the beginning of your next turn."
            },
            "smokeAndMirrors": {
              "name": "Smoke and Mirrors",
              "requirement": "None",
              "description": "When you make a Stealth check in obscured terrain, such as smoke, mist, rain, or snow, you gain a +5 circumstantial bonus to the check."
            },
            "vanish": {
              "name": "Vanish",
              "requirement": "None",
              "description": "Once per encounter, if an attack would reduce you to 0 hit points, make a Stealth check. If the result is greater than or equal to the attack roll that hit you, you can negate all of the incoming damage and immediately take a move action."
            }
          }
        }
      },
      "feats": {
        "compromisingStrike": {
          "name": "Compromising Strike",
          "requirement": "None",
          "description": "Your ability to utilize distractions allows you to deal more damage in melee combat. Add 1d8 damage to any melee attack performed against a target that is already engaged in melee combat with another character, or to any melee attack for which you have advantage, including attacks made from Stealth."
        },
        "scoundrelsLuck": {
          "name": "Scoundrel's Luck",
          "requirement": "None",
          "description": "At the start of a mission, roll three d20s and record each result. Throughout the mission, you can replace any check made by you or a creature that you can see with one of these rolls. You must declare your intention to do so before the roll occurs, and you can replace a roll in this way only once per round. Each roll can only be used once."
        },
        "shadowDealer": {
          "name": "Shadow Dealer",
          "requirement": "None",
          "description": "Your connections open doors that appear locked to others. Treat your faction standing with each faction as one level higher than your faction points would indicate, even if doing so grants you Allied faction standing with more than one faction."
        },
        "sprintAttack": {
          "name": "Sprint Attack",
          "requirement": "None",
          "description": "When opportunity strikes, you're quick to comply. Once per round, you can take a double move action and still take a combat action."
        },
        "unendingFlow": {
          "name": "Unending Flow",
          "requirement": "Compromising Strike",
          "description": "Wounds you inflict bleed profusely. When you deal Compromising Strike damage to an organic creature, it starts taking 1d6 damage at the beginning of each of its turns. At the end of each of its turns, it can spend a move action to attempt to staunch the flow by making a successful Healing check (DC 10). Multiple instances of Unending Flow are not cumulative."
        }
      }
    }
  },
  "raceData": {
    "dwarf": {
      "name": "Dwarf",
      "description": "True Underrace. Many of the so-called underraces have been forced to live underground due to socio-economic pressures or actual laws, but as a dwarf, you take pride in this moniker. You gain advantage on all checks to resist harsh environmental conditions, be it from heat, cold, lack of oxygen or even pressure. Additionally, you can see in the dark within 30 feet of you and can always tell how close you are to the surface while underground."
    },
    "gnome": {
      "name": "Gnome",
      "description": "Restless Mind. Gnomes are often defined by their ingenuity and out-of-the-box thinking. As a gnome, your mind is constantly racing, coming to conclusions and deductions faster than you can express them. This restless state of mind allows you to come up with creative solutions on the spot. Once per encounter, you can gain advantage on a Will-based check, including skill checks, of your choice. Additionally, if you spend 1 minute investigating an item, you automatically determine its function and purpose."
    },
    "highAuric": {
      "name": "High Auric",
      "description": "Eye for the Strange. Many humans would describe the underraces as 'magical,' but in the case of the high aurics, this concept takes on a different dimension of meaning. As a high auric, you can spend 1 minute to sense the presence of ceridium - be it an object or creature - within 60 feet of you. At the GM's discretion, you can sense higher concentrations of ceridium from much further distances, and some materials, like lead, can disrupt this ability. Additionally, high aurics are ambidextrous and never suffer from vertigo; when you make an Agility-based check to maintain your balance or perform feats of eye-hand coordination, you gain advantage on that check."
    },
    "human": {
      "name": "Human",
      "description": "Humanity's Privilege. All humans are created equal, with the operative word being 'humans.' You represent the dominant race on earth, and are treated accordingly. You gain advantage on all Personality-based checks, including skill checks, with a faction of your choice. Additionally, you gain 5 faction points with that faction at the beginning of your first mission."
    },
    "lowAuric": {
      "name": "Low Auric",
      "description": "Too Burly to Care. 'Freak.' 'Tusker.' 'Pig face.' Most humans think of you as stupid or violent, and you've experienced your fair share of derision. As the most imposing and phenotypically striking underrace, your path hasn't been easy, but has forged you into a sturdy opponent with an attitude to match. The other races can use you as cover, and if at any time you have less than half of your hit points remaining, you gain advantage on all Strength-based checks, including skill checks."
    }
  }
}